let N = +prompt("ведіть перше число");
let M = +prompt("ведіть друге число (більше за перше)");

while (isNaN(N) || isNaN(M)) {
  alert("Це не цифри!");
  N = prompt("ведіть перше число");
  M = prompt("ведіть друге число (більше за перше)");
}

N = Math.floor(N);
M = Math.floor(M);

while (M <= -1 || N <= -1) {
  alert(`введіть не від'ємні числа`);
  N = +prompt(`введіть перше число`);
  M = +prompt(`введіть друге число`);
}

while (N > M) {
  alert(`введіть більше число за попереднє`);
  M = +prompt(`введіть друге число більше число за попереднє`);
}

while (M === 0 || N === 0) {
  alert(`введіть число більше за нуль`);
  N = +prompt(`введыть перше число`);
  M = +prompt(`введіть друге число`);
}

while (M > 999999 || N > 999999) {
  alert(`введіть менші  числа за попередні`);
  N = +prompt(`введіть перше число`);
  M = +prompt(`введіть друге число`);
}

console.log(`${N} перше число`);
console.log(`${M} дрруге число`);

const isPaired = confirm(`Пропускати парні числа?`);

let sum = 0;
for (let i = N; i <= M; i++) {
  if (isPaired && i % 2 === 0) continue;
  sum = sum + i;
}

console.log(`Ваш результат: ${sum}`);
